# 리스트의 CRUD3S
# C: create : .append .insert
# R: read : [방번호] .len()
# U: update [방번호] = 변경값
# D: delete pop
# S: search find
# S: sort sorted
# S: shuffle


############################
# 리스트 선언
array = []
array = list()
array = [1, 1.1, "문자", True, [0, 1], None]
array.insert(0, "삽입")
array.append("추가")
array.pop(3)
print(array)

for i in array:
    print(i)


# 공백 리스트 생성
# 문자 H, e, l, l, o를 요소로 가지는 리스트
# 문자열 Hello를 요소로 가지는 리스트
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
# 공백 리스트 생성
# 문자열을 리스트로 변환. 문자 H, e, l, l, o를 요소로 가지는 리스트 생성
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
############################
############################
list1 = ["H", "e", "l", "l", "o"]
print(type(list1), list1)

list2 = ["Hello"]
print(type(list2), list2)

list4 = list("Hello")
print(type(list4), list4)

list3 = [0, 1, 2, 3, 4]
print(type(list3), list3)


# 리스트 요소 출력
############################


############################
# 리스트 출력
############################

############################
# 리스트 슬라이싱
############################

############################
# 리스트 요소 대입
############################

############################
# 리스트 열거
############################

############################
# 복잡한 리스트
# 1차원 리스트
# 2차원 리스트
# 3차원 리스트
############################


############################
# 리스트에 담을 수 있는 것은?
# 리스트 선언 [] list()
# 리스트 대입
# 리스트 출력
# 리스트 열거
# 리스트에 저장된 함수 실행하기
############################

############################
# 문자열 vs 리스트
############################
